CSI API ETABS v1

# cLoadCasesStaticLinear Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cCaseStaticLinear StaticLinear { get; }

    ReadOnly Property StaticLinear As cCaseStaticLinear
    	Get

    Dim instance As cLoadCases
    Dim value As cCaseStaticLinear

    value = instance.StaticLinear

    property cCaseStaticLinear^ StaticLinear {
    	cCaseStaticLinear^ get ();
    }

    abstract StaticLinear : cCaseStaticLinear with get

#### Property Value

Type: cCaseStaticLinear

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com